# 1.напишите код ввода двух чисел.Вычислите их разницу
# a = int(input('Введите число:'))
# b = int(input('Введите число:'))
# s = (a - b)
# print(s)


# 2.вычислите остаток деления 36 на 5
# number1 = 36
# number2 = 5
# print(number1 % number2)



# 3.Напишите проверку на то, является ли строка палиндромом.
# Палиндром — это слово или фраза, которые одинаково читаются
# слева направо и справа налево.
# text = ('заказ')
# print(text[::-1])

# 4. Дана строка “I love Java”. Выведите первые два слова I love Java”.
# Выведите первые два слова и добавьте к ним Python.
# text = 'I love java'
# print(text.replace('Java','Python')



# 5.Напишите код для ввода текста. Введите свое имя и выведите его в терминал 10 раз.
# name = input('Введите имя:')
#
# print(name)
# print(name*10)

# 6. Напишите код для ввода текста. Выведите все буквы в обратном порядке.
# text = input('Введите текст:')
# print(text[::-1])
# 7. Напишите код для ввода числа. Выведите его 10 цифру по порядку (Учтите, что число может быть коротким,
# в таком случае начинайте отсчет с первой цифры).

# 8. Напишите программу для получения первых 2 и последних 2 символов в строке.
# Если строка содержит 2 символа, выведите их 2 раза. Если в строке 2 символа, выведите саму строку.
# Если строка содержит меньше 2 символов, то выведите сообщение «Error».Error».
# Строка: 'You know nothing, John Snow'
# Результат: 'Yoow'
# Строка : 'hi'
# Результат : 'hi'
# Строка : ''
# Результат : Error
# 9. Напишите код для ввода числа. Выведите его предыдущее и следующее числа.
# (Например пользователь ввел 5. Вывод должен быть: 4, 6)

# 10. Пользователь вводит два числа. Сравните эти числа и выведите результат.
# Пример:
# First number: 10
# Second number: 5
# Результат: 10 > 5
# number1 = int(input('Введите число :'))
# number2 = int(input('Введите число :'))
# if number1 > number2:
#     print(number1)
# else:
#     print(number2)




#11. Пользователь вводит число. Проверьте отрицательное оно или положительное
# и выведите результаты (0 не является ни положительным, ни отрицательным)
# num = int(input('Введите число:'))
# if num > 0:
#     print('Это число положительное')
# else: print('Это число отрицательное')


